{
    "Sistemas operacionais multiprogramados possuem vários processos ativos, porém apenas um único processo em execução por vez, mesmo com várias CPUs disponíveis.": "False",
    "Um sistema operacional classificado como multitarefa é aquele em que vários processos de utilizador (tarefas) estejam carregados em memória; nesse caso, um pode estar ocupando o processador e outros ficam enfileirados, aguardando a sua vez.": "True",
    "O início da execução de um programa provocada pelo usuário leva à criação de processos deamons.": "False",
    "Um processo em execução não pode ser interrompido pelo sistema operacional monoprogramado antes do seu término.": "True",
    "A Apple aproveitou-se da falta de visão da Xerox e licenciou a Interface Gráfica que acabou sendo a raiz do sucesso de sua linha de computadores Macintosh.": "True",
    "Interrupções de hardware ou de software são utilizadas para sinalizar a ocorrência de eventos.": "True",
    "Em sistemas operacionais multiprogramáveis, vários programas podem estar carregados na memória simultaneamente.": "True",
    "Cabe ao sistema operacional a tarefa de gerenciar o acesso concorrente aos recursos compartilhados.": "True",
    "Um computador tem em geral uma variedade de diferentes recursos que podem ser adquiridos, mas um recurso é algo que pode ser usado por somente um único processo em um dado instante de tempo.": "True",
    "As principais funções do núcleo de um sistema operacional são as seguintes: tratamento de interrupções; criação, eliminação, sincronização e comunicação entre processos; gerência de memória e gerência de arquivos.": "True",
    "O tempo de resposta ao usuário é uma desvantagem da estruturação do sistema operacional em camadas, pois, em uma requisição do usuário, as camadas se comunicam entre elas, levando a um maior consumo de tempo no processamento.": "True",
    "Um processo em execução não pode ser interrompido pelo sistema operacional multiprogramado antes do seu término.": "False",
    "Processos ditos de segundo plano sempre estão associados a usuários e ficam aguardando alguma interação humana para entrarem em uma execução. ": "False",
    "Programas que possuem funções importantes para o funcionamento do sistema e que funcionam em background (segundo plano), durante a execução do sistema operacional, são denominados daemons.": "True",
    "As chamadas de sistema são importantes, pois abstraem para os processos a necessidade de manipular recursos diretamente no hardware, sendo comum seu provimento por diversos Sistemas Operacionais.": "True",
    "O Sistema Operacional poderá causar Pseudoparalelismo apenas se houver mais de uma CPU, ou seja, se o sistema for fortemente acoplado.": "False",
    "Considerado um gerenciador de recursos do computador, o sistema operacional é capaz de prover uma interface para o usuário, tornando o acesso a recursos do computador transparente ao usuário.": "True",
    "Gerenciar os recursos disponíveis do computador não é uma função do sistema operacional.": "False",
    "Em ambientes multiprogramados, os processos podem ser executados em diferentes processadores simultaneamente. ": "True",
    "Todo sistema operacional possui interface gráfica baseada em janelas.": "False",
    "A alternância da execução dos processos em tempos sequencialmente próximos causa paralelismo real.": "False",
    "A alternância da execução dos processos em tempos sequencialmente próximos causa ao usuário a ilusão de que os processos estão executando paralelamente, ou seja, Pseudoparalelismo.": "True",
    "Em ambiente multiprogramação, é necessário que exista uma proteção, por exemplo, contra o acesso de dispositivos de E/S ou a alocação de memória por mais de um programa ao mesmo tempo. Assim, o sistema operacional e os programas de usuários operam em modo privilegiado, o que garante que os conflitos no uso dos recursos não ocorram.": "False",
    "A visão top-down de um sistema operacional é definida, na perspectiva do usuário, como uma abstração de hardware.": "True",
    "O MS-DOS é um exemplo de sistema operacional monotarefa.": "True",
    "O Windows foi desenvolvido e mantido até hoje pela Apple.": "False",
    "Todo Sistema Operacional de Licença Livre tem seu código-fonte aberto e é desenvolvido somente por organizações com fins lucrativos.": "False",
    "Sistemas do tipo timesharing implementam um tipo de multiprogramação que permite o uso de terminais para interação com um ou mais programas, pela divisão do tempo de processamento, dando aos usuários a impressão de disporem da máquina para uso dedicado, especialmente quando a quantidade de terminais não é grande.": "True",
    "Um sistema operacional multitarefa tem como característica fundamental a execução simultânea de processos.": "False",
    "A interface entre o sistema operacional e os programas de usuário é definida por um conjunto de instruções estendidas denominadas chamadas de sistema.": "True",
    "Caso deseje, descreva brevemente o que poderia melhorar no conteúdo e metodologia de ensino/avaliação das semanas 01 e 02.": "Obrigado pelo feedback!"
}